SSorawit/Project_GAP_STM32/stm32_LoRa_Sensor_Mark2/LoRaWAN/App/lora_app.c
/* USER CODE END EF */

void LoRaWAN_Init(void)
{
  /* USER CODE BEGIN LoRaWAN_Init_LV */
  uint32_t feature_version = 0UL;
  /* USER CODE END LoRaWAN_Init_LV */
  SensorApp_Init();
  /* USER CODE BEGIN LoRaWAN_Init_1 */

  /* Get LoRaWAN APP version*/
  APP_LOG(TS_OFF, VLEVEL_M, "APPLICATION_VERSION: V%X.%X.%X\r\n",
          (uint8_t)(APP_VERSION_MAIN),
          (uint8_t)(APP_VERSION_SUB1),
          (uint8_t)(APP_VERSION_SUB2));

  /* Get MW LoRaWAN info */
  APP_LOG(TS_OFF, VLEVEL_M, "MW_LORAWAN_VERSION:  V%X.%X.%X\r\n",
          (uint8_t)(LORAWAN_VERSION_MAIN),
          (uint8_t)(LORAWAN_VERSION_SUB1),
          (uint8_t)(LORAWAN_VERSION_SUB2));

  /* Get MW SubGhz_Phy info */
  APP_LOG(TS_OFF, VLEVEL_M, "MW_RADIO_VERSION:    V%X.%X.%X\r\n",
          (uint8_t)(SUBGHZ_PHY_VERSION_MAIN),
          (uint8_t)(SUBGHZ_PHY_VERSION_SUB1),
          (uint8_t)(SUBGHZ_PHY_VERSION_SUB2));

  /* Get LoRaWAN Link Layer info */
  LmHandlerGetVersion(LORAMAC_HANDLER_L2_VERSION, &feature_version);
  APP_LOG(TS_OFF, VLEVEL_M, "L2_SPEC_VERSION:     V%X.%X.%X\r\n",
          (uint8_t)(feature_version >> 24),
          (uint8_t)(feature_version >> 16),
          (uint8_t)(feature_version >> 8));

  /* Get LoRaWAN Regional Parameters info */
  LmHandlerGetVersion(LORAMAC_HANDLER_REGION_VERSION, &feature_version);
  APP_LOG(TS_OFF, VLEVEL_M, "RP_SPEC_VERSION:     V%X-%X.%X.%X\r\n",
          (uint8_t)(feature_version >> 24),
          (uint8_t)(feature_version >> 16),
          (uint8_t)(feature_version >> 8),
          (uint8_t)(feature_version));

  UTIL_TIMER_Create(&TxLedTimer, LED_PERIOD_TIME, UTIL_TIMER_ONESHOT, OnTxTimerLedEvent, NULL);
  UTIL_TIMER_Create(&RxLedTimer, LED_PERIOD_TIME, UTIL_TIMER_ONESHOT, OnRxTimerLedEvent, NULL);
  UTIL_TIMER_Create(&JoinLedTimer, LED_PERIOD_TIME, UTIL_TIMER_PERIODIC, OnJoinTimerLedEvent, NULL);

  /* USER CODE END LoRaWAN_Init_1 */

  UTIL_TIMER_Create(&StopJoinTimer, JOIN_TIME, UTIL_TIMER_ONESHOT, OnStopJoinTimerEvent, NULL);

  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LmHandlerProcess), UTIL_SEQ_RFU, LmHandlerProcess);

  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), UTIL_SEQ_RFU, SendTxData);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaStoreContextEvent), UTIL_SEQ_RFU, StoreContext);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaStopJoinEvent), UTIL_SEQ_RFU, StopJoin);

  /* Init Info table used by LmHandler*/
  LoraInfo_Init();

  /* Init the Lora Stack*/
  LmHandlerInit(&LmHandlerCallbacks, APP_VERSION);

  LmHandlerConfigure(&LmHandlerParams);

  /* USER CODE BEGIN LoRaWAN_Init_2 */
  UTIL_TIMER_Start(&JoinLedTimer);

  /* USER CODE END LoRaWAN_Init_2 */

  LmHandlerJoin(ActivationType, ForceRejoin);

  if (EventType == TX_ON_TIMER)
  {
    /* send every time timer elapses */
    UTIL_TIMER_Create(&TxTimer, TxPeriodicity, UTIL_TIMER_ONESHOT, OnTxTimerEvent, NULL);
    UTIL_TIMER_Start(&TxTimer);
  }
  else
  {
    /* USER CODE BEGIN LoRaWAN_Init_3 */

    /* USER CODE END LoRaWAN_Init_3 */
  }

  /* USER CODE BEGIN LoRaWAN_Init_Last */

  /* USER CODE END LoRaWAN_Init_Last */
}

/* USER CODE BEGIN PB_Callbacks */

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch (GPIO_Pin)
  {
    case  BUT1_Pin:
    	// XXX: always initialized
      if (EventType == TX_ON_EVENT || 1)
      {
        UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);
      }
      break;
    default:
      break;
  }
}

/* USER CODE END PB_Callbacks */

/* Private functions ---------------------------------------------------------*/
/* USER CODE BEGIN PrFD */

/* USER CODE END PrFD */

static void OnRxData(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params)
{
  uint8_t RxPort = 0;

  if (params != NULL && appData != NULL && appData->Buffer != NULL)
  {
    UTIL_TIMER_Start(&RxLedTimer);

    APP_LOG(TS_OFF, VLEVEL_M, ">>> LoRa RX: Received %d bytes on Port %d\r\n", appData->BufferSize, appData->Port);
    for (uint8_t i = 0; i < appData->BufferSize; i++)
    {
      APP_LOG(TS_OFF, VLEVEL_M, "0x%02X ", appData->Buffer[i]);
    }
    APP_LOG(TS_OFF, VLEVEL_M, "\r\n");

    bool isAscii = true;
    for (uint8_t i = 0; i < appData->BufferSize; i++) {
      if (appData->Buffer[i] < 32 || appData->Buffer[i] > 126) {
        isAscii = false;
        break;
      }
    }
    if (isAscii)
    {
      char msg[appData->BufferSize + 1];
      memcpy(msg, appData->Buffer, appData->BufferSize);
      msg[appData->BufferSize] = '\0';
      APP_LOG(TS_OFF, VLEVEL_M, ">>> ASCII: %s\r\n", msg);
    }

    RxPort = appData->Port;

    if (params->IsMcpsIndication)
    {
      switch (appData->Port)
      {
        case LORAWAN_SWITCH_CLASS_PORT:
          if (appData->BufferSize == 1)
          {
            switch (appData->Buffer[0])
            {
              case 0: LmHandlerRequestClass(CLASS_A); break;
              case 1: LmHandlerRequestClass(CLASS_B); break;
              case 2: LmHandlerRequestClass(CLASS_C); break;
              default: break;
            }
          }
          break;

        case LORAWAN_USER_APP_PORT:
        {
          if (appData->BufferSize == 1)
          {
            switch (appData->Buffer[0])
            {
              case 0x01:
                HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET);
                APP_LOG(TS_OFF, VLEVEL_M, "[CMD] LED turned ON (Manual)\r\n");
                break;

              case 0x03:
                HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET);
                APP_LOG(TS_OFF, VLEVEL_M, "[CMD] LED turned OFF (Immediately)\r\n");
                break;

              default:
                APP_LOG(TS_OFF, VLEVEL_M, "[WARN] Unknown 1-byte command: 0x%02X\r\n", appData->Buffer[0]);
                break;
            }
          }
          else if (appData->BufferSize == 2 && appData->Buffer[0] == 0x02)
          {
            uint8_t duration_min = appData->Buffer[1];
            HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET);
            APP_LOG(TS_OFF, VLEVEL_M, "[CMD] LED turned ON (Auto %d minute%s)\r\n",
                    duration_min, duration_min > 1 ? "s" : "");

